#ifndef _NTDLL_H_
#define _NTDLL_H_

#if defined (_MSC_VER) && (_MSC_VER >= 1020)
#pragma once
#endif

#define WIN32_NO_STATUS
#include "ntstatus.h"

#define _WINTERNL_

#include <windows.h>

#ifdef _NTDDK_
#error NTDLL.H cannot be compiled together with NTDDK.H
#endif

#ifdef __cplusplus
extern "C" {
#endif

	typedef long KAFFINITY;
	typedef long ULONG_PTR;
	
	typedef enum {
		PowerActionNone = 0,
			PowerActionReserved,
			PowerActionSleep,
			PowerActionHibernate,
			PowerActionShutdown,
			PowerActionShutdownReset,
			PowerActionShutdownOff,
			PowerActionWarmEject
	} POWER_ACTION, *PPOWER_ACTION;
	
	typedef enum _DEVICE_POWER_STATE {
		PowerDeviceUnspecified = 0,
			PowerDeviceD0,
			PowerDeviceD1,
			PowerDeviceD2,
			PowerDeviceD3,
			PowerDeviceMaximum
	} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;
	
	typedef enum _SYSTEM_POWER_STATE {
		PowerSystemUnspecified = 0,
			PowerSystemWorking     = 1,
			PowerSystemSleeping1   = 2,
			PowerSystemSleeping2   = 3,
			PowerSystemSleeping3   = 4,
			PowerSystemHibernate   = 5,
			PowerSystemShutdown    = 6,
			PowerSystemMaximum     = 7
	} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;
	
	typedef enum {
		SystemPowerPolicyAc,
			SystemPowerPolicyDc,
			VerifySystemPolicyAc,
			VerifySystemPolicyDc,
			SystemPowerCapabilities,
			SystemBatteryState,
			SystemPowerStateHandler,
			ProcessorStateHandler,
			SystemPowerPolicyCurrent,
			AdministratorPowerPolicy,
			SystemReserveHiberFile,
			ProcessorInformation,
			SystemPowerInformation,
			ProcessorStateHandler2,
			LastWakeTime,                                   // Compare with KeQueryInterruptTime()
			LastSleepTime,                                  // Compare with KeQueryInterruptTime()
			SystemExecutionState,
			SystemPowerStateNotifyHandler,
			ProcessorPowerPolicyAc,
			ProcessorPowerPolicyDc,
			VerifyProcessorPowerPolicyAc,
			VerifyProcessorPowerPolicyDc,
			ProcessorPowerPolicyCurrent,
			SystemPowerStateLogging,
			SystemPowerLoggingEntry,
			SetPowerSettingValue,
			NotifyUserPowerSetting,
			GetPowerTransitionVetoes,
			SetPowerTransitionVeto,
			SystemVideoState,
			TraceApplicationPowerMessage,
			TraceApplicationPowerMessageEnd,
			ProcessorPerfStates,
			ProcessorIdleStates,
			ProcessorThrottleStates,
			SystemWakeSource,
			SystemHiberFileInformation,
			TraceServicePowerMessage,
			ProcessorLoad,
			PowerShutdownNotification,
			MonitorCapabilities
} POWER_INFORMATION_LEVEL;

typedef long NTSTATUS;
typedef long KPRIORITY;

// Generic test for success on any status value (non-negative numbers indicate success).
#define NT_SUCCESS(Status) ((NTSTATUS)(Status) >= 0)

// Generic test for information on any status value.
#define NT_INFORMATION(Status) ((ULONG)(Status) >> 30 == 1)

// Generic test for warning on any status value.
#define NT_WARNING(Status) ((ULONG)(Status) >> 30 == 2)

// Generic test for error on any status value.
#define NT_ERROR(Status) ((ULONG)(Status) >> 30 == 3)

#define MAXIMUM_SUPPORTED_EXTENSION     512

// Define the size of the 80387 save area, which is in the context frame.
#define SIZE_OF_80387_REGISTERS      80

//
// Define the create/open option flags
//

#define FILE_SYNCHRONOUS_IO_NONALERT            0x00000020

//
// Valid values for the Attributes field
//

#define OBJ_INHERIT             0x00000002L
#define OBJ_PERMANENT           0x00000010L
#define OBJ_EXCLUSIVE           0x00000020L
#define OBJ_CASE_INSENSITIVE    0x00000040L
#define OBJ_OPENIF              0x00000080L
#define OBJ_OPENLINK            0x00000100L
#define OBJ_KERNEL_HANDLE       0x00000200L
#define OBJ_FORCE_ACCESS_CHECK  0x00000400L
#define OBJ_VALID_ATTRIBUTES    0x000007F2L

#define NtCurrentProcess() ((HANDLE)(LONG_PTR)-1)
#define ZwCurrentProcess() NtCurrentProcess()
#define NtCurrentThread()  ((HANDLE)(LONG_PTR)-2)
#define ZwCurrentThread()  NtCurrentThread()

//
// Counted String
//

typedef USHORT RTL_STRING_LENGTH_TYPE;

typedef struct _STRING
{
	USHORT Length;
	USHORT MaximumLength;
#ifdef MIDL_PASS
	[size_is(MaximumLength), length_is(Length) ]
#endif // MIDL_PASS
	PCHAR Buffer;
} STRING;
typedef STRING *PSTRING;

typedef STRING ANSI_STRING;
typedef PSTRING PANSI_STRING;

typedef STRING OEM_STRING;
typedef PSTRING POEM_STRING;
typedef CONST STRING* PCOEM_STRING;

//
// CONSTCounted String
//

typedef struct _CSTRING
{
	USHORT Length;
	USHORT MaximumLength;
	CONST char *Buffer;
} CSTRING;
typedef CSTRING *PCSTRING;
#define ANSI_NULL ((CHAR)0)	 // winnt

typedef STRING CANSI_STRING;
typedef PSTRING PCANSI_STRING;

//
// Unicode strings are counted 16-bit character strings. If they are
// NULL terminated, Length does not include trailing NULL.
//

typedef struct _UNICODE_STRING
{
	USHORT Length;	// Unicode字符串的长度，单位字节，不包括'\0'
	USHORT MaximumLength;
#ifdef MIDL_PASS
	[size_is(MaximumLength / 2), length_is((Length) / 2) ] USHORT * Buffer;
#else // MIDL_PASS
	PWSTR  Buffer;
#endif // MIDL_PASS
} UNICODE_STRING;
typedef UNICODE_STRING *PUNICODE_STRING;
typedef const UNICODE_STRING *PCUNICODE_STRING;
#define UNICODE_NULL ((WCHAR)0) // winnt

#if _WIN32_WINNT >= 0x0501

#define UNICODE_STRING_MAX_BYTES ((USHORT) 65534) // winnt
#define UNICODE_STRING_MAX_CHARS (32767) // winnt

#define DECLARE_CONST_UNICODE_STRING(_variablename, _string) \
const WCHAR _variablename ## _buffer[] = _string; \
const UNICODE_STRING _variablename = { sizeof(_string) - sizeof(WCHAR), sizeof(_string), (PWSTR) _variablename ## _buffer };

#endif // _WIN32_WINNT >= 0x0501

#define RTL_CONSTANT_STRING(s) {sizeof(s) - sizeof((s)[0]), sizeof(s), s}

typedef enum _OBJECT_INFORMATION_CLASS
{
	ObjectBasicInformation,		// Result is OBJECT_BASIC_INFORMATION structure
	ObjectNameInformation,		// Result is OBJECT_NAME_INFORMATION structure
	ObjectTypeInformation,		// Result is OBJECT_TYPE_INFORMATION structure
	ObjectAllTypesInformation,	// Result is OBJECT_ALL_INFORMATION structure
	ObjectHandleInformation		// Result is OBJECT_DATA_INFORMATION structure
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef struct _OBJECT_NAME_INFORMATION
{
	UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION;

typedef struct _OBJECT_ATTRIBUTES
{
	ULONG Length;
	HANDLE RootDirectory;
	PUNICODE_STRING ObjectName;
	ULONG Attributes;
	PVOID SecurityDescriptor;		// Points to type SECURITY_DESCRIPTOR
	PVOID SecurityQualityOfService;	// Points to type SECURITY_QUALITY_OF_SERVICE
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES;
typedef const OBJECT_ATTRIBUTES *PCOBJECT_ATTRIBUTES;

//++
//
// VOID
// InitializeObjectAttributes(
//     OUT POBJECT_ATTRIBUTES p,
//     IN PUNICODE_STRING n,
//     IN ULONG a,
//     IN HANDLE r,
//     IN PSECURITY_DESCRIPTOR s
//     )
//
//--

#define InitializeObjectAttributes( p, n, a, r, s ) { \
    (p)->Length = sizeof( OBJECT_ATTRIBUTES );          \
    (p)->RootDirectory = r;                             \
    (p)->Attributes = a;                                \
    (p)->ObjectName = n;                                \
    (p)->SecurityDescriptor = s;                        \
    (p)->SecurityQualityOfService = NULL;               \
    }

typedef struct _CLIENT_ID
{
	HANDLE UniqueProcess;
	HANDLE UniqueThread;
} CLIENT_ID, *PCLIENT_ID;

// Thread Information Classes
typedef enum _THREADINFOCLASS
{
	ThreadBasicInformation,          // 0
	ThreadTimes,                     // 1
	ThreadPriority,                  // 2
	ThreadBasePriority,              // 3
	ThreadAffinityMask,              // 4
	ThreadImpersonationToken,        // 5
	ThreadDescriptorTableEntry,      // 6
	ThreadEnableAlignmentFaultFixup, // 7
	ThreadEventPair_Reusable,        // 8
	ThreadQuerySetWin32StartAddress, // 9
	ThreadZeroTlsCell,               // 10
	ThreadPerformanceCount,          // 11
	ThreadAmILastThread,             // 12
	ThreadIdealProcessor,            // 13
	ThreadPriorityBoost,             // 14
	ThreadSetTlsArrayAddress,        // 15
	ThreadIsIoPending,               // 16
	ThreadHideFromDebugger,          // 17
	ThreadBreakOnTermination,        // 18
	MaxThreadInfoClass               // 19
} THREADINFOCLASS, *PTHREADINFOCLASS;

typedef enum _SYSTEM_INFORMATION_CLASS
{
	SystemBasicInformation,              // 0        Y        N
	SystemProcessorInformation,          // 1        Y        N
	SystemPerformanceInformation,        // 2        Y        N
	SystemTimeOfDayInformation,          // 3        Y        N
	SystemNotImplemented1,               // 4        Y        N
	SystemProcessInformation,            // 5        Y        N
	SystemCallCounts,                    // 6        Y        N
	SystemConfigurationInformation,      // 7        Y        N
	SystemProcessorPerformanceInformation,// 8        Y        N
	SystemGlobalFlag,                    // 9        Y        Y
	SystemNotImplemented2,               // 10       Y        N
	SystemModuleInformation,             // 11       Y        N
	SystemLockInformation,               // 12       Y        N
	SystemNotImplemented3,               // 13       Y        N
	SystemNotImplemented4,               // 14       Y        N
	SystemNotImplemented5,               // 15       Y        N
	SystemHandleInformation,             // 16       Y        N
	SystemObjectInformation,             // 17       Y        N
	SystemPagefileInformation,           // 18       Y        N
	SystemInstructionEmulationCounts,    // 19       Y        N
	SystemInvalidInfoClass1,             // 20
	SystemCacheInformation,              // 21       Y        Y
	SystemPoolTagInformation,            // 22       Y        N
	SystemInterruptInformation,          // 23       Y        N
	SystemDpcInformation,                // 24       Y        Y
	SystemNotImplemented6,               // 25       Y        N
	SystemLoadImage,                     // 26       N        Y
	SystemUnloadImage,                   // 27       N        Y
	SystemTimeAdjustment,                // 28       Y        Y
	SystemNotImplemented7,               // 29       Y        N
	SystemNotImplemented8,               // 30       Y        N
	SystemNotImplemented9,               // 31       Y        N
	SystemCrashDumpInformation,          // 32       Y        N
	SystemExceptionInformation,          // 33       Y        N
	SystemCrashDumpStateInformation,     // 34       Y        Y/N
	SystemKernelDebuggerInformation,     // 35       Y        N
	SystemContextSwitchInformation,      // 36       Y        N
	SystemRegistryQuotaInformation,      // 37       Y        Y
	SystemLoadAndCallImage,              // 38       N        Y
	SystemPrioritySeparation,            // 39       N        Y
	SystemNotImplemented10,              // 40       Y        N
	SystemNotImplemented11,              // 41       Y        N
	SystemInvalidInfoClass2,             // 42
	SystemInvalidInfoClass3,             // 43
	SystemTimeZoneInformation,           // 44       Y        N
	SystemLookasideInformation,          // 45       Y        N
	SystemSetTimeSlipEvent,              // 46       N        Y
	SystemCreateSession,                 // 47       N        Y
	SystemDeleteSession,                 // 48       N        Y
	SystemInvalidInfoClass4,             // 49
	SystemRangeStartInformation,         // 50       Y        N
	SystemVerifierInformation,           // 51       Y        Y
	SystemAddVerifier,                   // 52       N        Y
	SystemSessionProcessesInformation,   // 53       Y        N
	SystemLoadGdiDriverInSystemSpace,
	SystemNumaProcessorMap,
	SystemPrefetcherInformation,
	SystemExtendedProcessInformation,
	SystemRecommendedSharedDataAlignment,
	SystemComPlusPackage,
	SystemNumaAvailableMemory,
	SystemProcessorPowerInformation,
	SystemEmulationBasicInformation,
	SystemEmulationProcessorInformation,
	SystemExtendedHandleInformation,
	SystemLostDelayedWriteInformation,
	SystemBigPoolInformation,
	SystemSessionPoolTagInformation,
	SystemSessionMappedViewInformation,
	SystemHotpatchInformation,
	SystemObjectSecurityMode,
	SystemWatchdogTimerHandler,
	SystemWatchdogTimerInformation,
	SystemLogicalProcessorInformation,
	SystemWow64SharedInformation,
	SystemRegisterFirmwareTableInformationHandler,
	SystemFirmwareTableInformation,
	SystemModuleInformationEx,
	SystemVerifierTriageInformation,
	SystemSuperfetchInformation,
	SystemMemoryListInformation,
	SystemFileCacheInformationEx,
	MaxSystemInfoClass	// MaxSystemInfoClass should always be the last enum
} SYSTEM_INFORMATION_CLASS, *PSYSTEM_INFORMATION_CLASS;

typedef struct _THREAD_BASIC_INFORMATION
{
	NTSTATUS  ExitStatus;
	PNT_TIB   TebBaseAddress;
	CLIENT_ID ClientId;
	KAFFINITY AffinityMask;
	KPRIORITY Priority;
	KPRIORITY BasePriority;
} THREAD_BASIC_INFORMATION, *PTHREAD_BASIC_INFORMATION;

typedef struct _SYSTEM_PROCESS_INFORMATION
{
	ULONG NextEntryOffset;
	ULONG NumberOfThreads;
	ULONG Reserved1[6];
	LARGE_INTEGER CreateTime;
	LARGE_INTEGER UserTime;
	LARGE_INTEGER KernelTime;
	UNICODE_STRING ProcessName;
	ULONG BasePriority;
	HANDLE UniqueProcessId;
	PVOID Reserved2;
	ULONG HandleCount;
	BYTE Reserved3[4];
	PVOID Reserved4[11];
	SIZE_T PeakPagefileUsage;
	SIZE_T PrivatePageCount;
	LARGE_INTEGER Reserved5[6];
} SYSTEM_PROCESS_INFORMATION, *PSYSTEM_PROCESS_INFORMATION;

typedef struct _PEB_LDR_DATA	// 7 elements, 0x28 bytes (sizeof)
{
/*0x000*/ ULONG Length;
/*0x004*/ UCHAR Initialized;
/*0x005*/ BYTE  _PADDING0_[3];
/*0x008*/ HANDLE SsHandle;
/*0x00C*/ LIST_ENTRY InLoadOrderModuleList;
/*0x014*/ LIST_ENTRY InMemoryOrderModuleList;
/*0x01C*/ LIST_ENTRY InInitializationOrderModuleList;
/*0x024*/ PVOID EntryInProgress;
/*0x028*/ //UCHAR ShutdownInProgress;	// for Vista
/*0x029*/ //BYTE  _PADDING1_[3];		// for Vista
/*0x02C*/ //PVOID ShutdownThreadId;		// for Vista
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct _CURDIR
{
	UNICODE_STRING DosPath;
	HANDLE         Handle;
} CURDIR, *PCURDIR;

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
	USHORT Flags;
	USHORT Length;
	ULONG  TimeStamp;
	STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
/*0x000*/ ULONG MaximumLength;
/*0x004*/ ULONG Length;
/*0x008*/ ULONG Flags;
/*0x00C*/ ULONG DebugFlags;
/*0x010*/ PVOID ConsoleHandle;
/*0x014*/ ULONG ConsoleFlags;
/*0x018*/ PVOID StandardInput;
/*0x01C*/ PVOID StandardOutput;
/*0x020*/ PVOID StandardError;
/*0x024*/ CURDIR CurrentDirectory;
/*0x030*/ UNICODE_STRING DllPath;
/*0x038*/ UNICODE_STRING ImagePathName;
/*0x040*/ UNICODE_STRING CommandLine;
/*0x048*/ PVOID Environment;
/*0x04C*/ ULONG StartingX;
/*0x050*/ ULONG StartingY;
/*0x054*/ ULONG CountX;
/*0x058*/ ULONG CountY;
/*0x05C*/ ULONG CountCharsX;
/*0x060*/ ULONG CountCharsY;
/*0x064*/ ULONG FillAttribute;
/*0x068*/ ULONG WindowFlags;
/*0x06C*/ ULONG ShowWindowFlags;
/*0x070*/ UNICODE_STRING WindowTitle;
/*0x078*/ UNICODE_STRING DesktopInfo;
/*0x080*/ UNICODE_STRING ShellInfo;
/*0x088*/ UNICODE_STRING RuntimeData;
/*0x090*/ RTL_DRIVE_LETTER_CURDIR CurrentDirectores[32];
/*0x290*/ //ULONG EnvironmentSize;	// for Vista
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS, PROCESS_PARAMETERS, *PPROCESS_PARAMETERS;

typedef struct _PEB_FREE_BLOCK
{
	_PEB_FREE_BLOCK* Next;
	ULONG            Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

typedef struct _PEB *PPEB;

// Basic Process Information, NtQueryInformationProcess using ProcessBasicInfo
typedef struct _PROCESS_BASIC_INFORMATION
{
	NTSTATUS  ExitStatus;
	PPEB      PebBaseAddress;
	ULONG_PTR AffinityMask;
	KPRIORITY BasePriority;
	ULONG_PTR UniqueProcessId;
	ULONG_PTR InheritedFromUniqueProcessId;
} PROCESS_BASIC_INFORMATION, *PPROCESS_BASIC_INFORMATION;

typedef struct _SYSTEM_HANDLE_INFORMATION
{
	ULONG ProcessId;
	UCHAR ObjectTypeNumber;
	UCHAR Flags;  // 0x01 = PROTECT_FROM_CLOSE, 0x02 = INHERIT
	USHORT Handle;
	PVOID Object;
	ACCESS_MASK GrantedAccess;
} SYSTEM_HANDLE_INFORMATION, *PSYSTEM_HANDLE_INFORMATION;

typedef enum _PROCESS_INFORMATION_CLASS
{
	ProcessBasicInformation,
	ProcessQuotaLimits,
	ProcessIoCounters,
	ProcessVmCounters,
	ProcessTimes,
	ProcessBasePriority,
	ProcessRaisePriority,
	ProcessDebugPort,
	ProcessExceptionPort,
	ProcessAccessToken,
	ProcessLdtInformation,
	ProcessLdtSize,
	ProcessDefaultHardErrorMode,
	ProcessIoPortHandlers,
	ProcessPooledUsageAndLimits,
	ProcessWorkingSetWatch,
	ProcessUserModeIOPL,
	ProcessEnableAlignmentFaultFixup,
	ProcessPriorityClass,
	ProcessWx86Information,
	ProcessHandleCount,
	ProcessAffinityMask,
	ProcessPriorityBoost,
	MaxProcessInfoClass
} PROCESSINFOCLASS, PROCESS_INFORMATION_CLASS, *PPROCESS_INFORMATION_CLASS;

typedef enum _SYSTEM_HANDLE_TYPE
{
	OB_TYPE_UNKNOWN,
	OB_TYPE_TYPE,
	OB_TYPE_DIRECTORY,
	OB_TYPE_SYMBOLIC_LINK,
	OB_TYPE_TOKEN,
	OB_TYPE_PROCESS,
	OB_TYPE_THREAD,
	OB_TYPE_UNKNOWN_7,
	OB_TYPE_EVENT,
	OB_TYPE_EVENT_PAIR,
	OB_TYPE_MUTANT,
	OB_TYPE_UNKNOWN_11,
	OB_TYPE_SEMAPHORE,
	OB_TYPE_TIMER,
	OB_TYPE_PROFILE,
	OB_TYPE_WINDOW_STATION,
	OB_TYPE_DESKTOP,
	OB_TYPE_SECTION,
	OB_TYPE_KEY,
	OB_TYPE_PORT,
	OB_TYPE_WAITABLE_PORT,
	OB_TYPE_UNKNOWN_21,
	OB_TYPE_UNKNOWN_22,
	OB_TYPE_UNKNOWN_23,
	OB_TYPE_UNKNOWN_24,
	OB_TYPE_IO_COMPLETION,
	OB_TYPE_FILE
} SYSTEM_HANDLE_TYPE, *PSYSTEM_HANDLE_TYPE;

typedef enum _KEY_VALUE_INFORMATION_CLASS {
	KeyValueBasicInformation,
	KeyValueFullInformation,
	KeyValuePartialInformation,
	KeyValueFullInformationAlign64,
	KeyValuePartialInformationAlign64
} KEY_VALUE_INFORMATION_CLASS;

typedef struct _KEY_VALUE_PARTIAL_INFORMATION {
	ULONG TitleIndex;
	ULONG Type;
	ULONG DataLength;
	UCHAR Data[1];            // Variable size
} KEY_VALUE_PARTIAL_INFORMATION, *PKEY_VALUE_PARTIAL_INFORMATION;

typedef struct _KEY_VALUE_BASIC_INFORMATION {
	ULONG TitleIndex;
	ULONG Type;
	ULONG NameLength;
	WCHAR Name[1];            // Variable size
} KEY_VALUE_BASIC_INFORMATION, *PKEY_VALUE_BASIC_INFORMATION;

// Define the base asynchronous I/O argument types
typedef struct _IO_STATUS_BLOCK
{
	union
	{
		NTSTATUS Status;
		PVOID    Pointer;
	};

	ULONG_PTR Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK;

// Section Information Structures.
typedef enum _SECTION_INHERIT
{
	ViewShare = 1,
	ViewUnmap = 2
} SECTION_INHERIT;

typedef struct _SECTION_IMAGE_INFORMATION
{
	PVOID EntryPoint;
	ULONG StackZeroBits;
	ULONG StackReserved;
	ULONG StackCommit;
	ULONG ImageSubsystem;
	WORD  SubsystemVersionLow;
	WORD  SubsystemVersionHigh;
	ULONG Unknown1;
	ULONG ImageCharacteristics;
	ULONG ImageMachineType;
	ULONG Unknown2[3];
} SECTION_IMAGE_INFORMATION, *PSECTION_IMAGE_INFORMATION;

#pragma pack(push)
#pragma pack(1)
typedef struct _LDR_DATA_TABLE_ENTRY	// 18 elements, 0x50 bytes (sizeof) 
{
/*0x000*/ LIST_ENTRY InLoadOrderLinks;
/*0x008*/ LIST_ENTRY InMemoryOrderLinks;
/*0x010*/ LIST_ENTRY InInitializationOrderLinks;
/*0x018*/ PVOID DllBase;
/*0x01C*/ PVOID EntryPoint;
/*0x020*/ ULONG SizeOfImage;
/*0x024*/ UNICODE_STRING FullDllName;
/*0x02C*/ UNICODE_STRING BaseDllName;
/*0x034*/ ULONG Flags;
/*0x038*/ USHORT LoadCount;
/*0x03A*/ USHORT TlsIndex;
          union
          {                                                                                  
/*0x03C*/     LIST_ENTRY HashLinks;
              struct
              {                                                                              
/*0x03C*/         PVOID SectionPointer;
/*0x040*/         ULONG CheckSum;
              };
          };
          union
          {                                                                                  
/*0x044*/     ULONG TimeDateStamp;
/*0x044*/     PVOID LoadedImports;
          };
/*0x048*/ PVOID EntryPointActivationContext;
/*0x04C*/ PVOID PatchInformation;
/*0x050*/ //LIST_ENTRY ForwarderLinks;	// for Vista
/*0x058*/ //LIST_ENTRY ServiceTagLinks;	// for Vista
/*0x060*/ //LIST_ENTRY StaticLinks;		// for Vista
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;
#pragma pack(pop)

typedef enum _SHUTDOWN_ACTION
{
	ShutdownNoReboot,
	ShutdownReboot,
	ShutdownPowerOff
} SHUTDOWN_ACTION, *PSHUTDOWN_ACTION;

typedef enum _DEBUG_CONTROL_CODE
{
	DebugGetTraceInformation = 1,
	DebugSetInternalBreakpoint,
	DebugSetSpecialCall,
	DebugClearSpecialCalls,
	DebugQuerySpecialCalls,
	DebugDbgBreakPoint
} DEBUG_CONTROL_CODE, *PDEBUG_CONTROL_CODE;

typedef enum _POOL_TYPE
{
	NonPagedPool,
	PagedPool,
	NonPagedPoolMustSucceed,
	DontUseThisType,
	NonPagedPoolCacheAligned,
	PagedPoolCacheAligned,
	NonPagedPoolCacheAlignedMustS,
	MaxPoolType,

	//
	// Note these per session types are carefully chosen so that the appropriate
	// masking still applies as well as MaxPoolType above.
	//

